Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: فلذلك فادع واستقم كما أمرت ولا تتبع أهواءهم وقل آمنت بما أنزل الله من كتاب وأمرت لأعدل بينكم الله ربنا وربكم لنا أعمالنا ولكم أعمالكم لا حجة بيننا وبينكم الله يجمع بيننا وإليه المصير
en: Now then, for that (reason), call (them to the Faith), and stand steadfast as thou art commanded, nor follow thou their vain desires; but say: "I believe in the Book which Allah has sent down; and I am commanded to judge justly between you. Allah is our Lord and your Lord: for us (is the responsibility for) our deeds, and for you for your deeds. There is no contention between us and you. Allah will bring us together, and to Him is (our) Final Goal.

source: والذين يحاجون في الله من بعد ما استجيب له حجتهم داحضة عند ربهم وعليهم غضب ولهم عذاب شديد
en: But those who dispute concerning Allah after He has been accepted,- futile is their dispute in the Sight of their Lord: on them will be a Penalty terrible.

source: الله الذي أنزل الكتاب بالحق والميزان وما يدريك لعل الساعة قريب
en: It is Allah Who has sent down the Book in Truth, and the Balance (by which to weigh conduct). And what will make thee realise that perhaps the Hour is close at hand?

source: يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق ألا إن الذين يمارون في الساعة لفي ضلال بعيد
en: Only those wish to hasten it who believe not in it: those who believe hold it in awe, and know that it is the Truth. Behold, verily those that dispute concerning the Hour are far astray.

source: الله لطيف بعباده يرزق من يشاء وهو القوي العزيز
en: Gracious is Allah to His servants: He gives Sustenance to whom He pleases: and He has power and can carry out His Will.

source: من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب
en: To any that desires the tilth of the Hereafter, We give increase in his tilth, and to any that desires the tilth of this world, We grant somewhat thereof, but he has no share or lot in the Hereafter.

source: أم لهم شركاء شرعوا لهم من الدين ما لم يأذن به الله ولولا كلمة الفصل لقضي بينهم وإن الظالمين لهم عذاب أليم
en: What! have they partners (in godhead), who have established for them some religion without the permission of Allah? Had it not been for the Decree of Judgment, the matter would have been decided between them (at once). But verily the Wrong-doers will have a grievous Penalty.

source: ترى الظالمين مشفقين مما كسبوا وهو واقع بهم والذين آمنوا وعملوا الصالحات في روضات الجنات لهم ما يشاءون عند ربهم ذلك هو الفضل الكبير
en: Thou wilt see the Wrong-doers in fear on account of what they have earned, and (the burden of) that must (necessarily) fall on them. But those who believe and work righteous deeds will be in the luxuriant meads of the Gardens: they shall have, before their Lord, all that they wish for. That will indeed be the magnificent Bounty (of Allah).

source: ذلك الذي يبشر الله عباده الذين آمنوا وعملوا الصالحات قل لا أسألكم عليه أجرا إلا المودة في القربى ومن يقترف حسنة نزد له فيها حسنا إن الله غفور شكور
en: That is (the Bounty) whereof Allah gives Glad Tidings to His Servants who believe and do righteous deeds. Say: "No reward do I ask of you for this except the love of those near of kin." And if any one earns any good, We shall give him an increase of good in respect thereof: for Allah is Oft-Forgiving, Most Ready to appreciate (service).

source: أم يقولون افترى على الله كذبا فإن يشإ الله يختم على قلبك ويمح الله الباطل ويحق الحق بكلماته إنه عليم بذات الصدور
en: What! Do they say, "He has forged a falsehood against Allah"? But if Allah willed, He could seal up thy heart. And Allah blots out Vanity, and proves the Truth by His Words. For He knows well the secrets of all hearts.

source: وهو الذي يقبل التوبة عن عباده ويعفو عن السيئات ويعلم ما تفعلون
en: He is the One that accepts repentance from His Servants and forgives sins: and He knows all that ye do.

source: ويستجيب الذين آمنوا وعملوا الصالحات ويزيدهم من فضله والكافرون لهم عذاب شديد
en: And He listens to those who believe and do deeds of righteousness, and gives them increase of His Bounty: but for the Unbelievers their is a terrible Penalty.

source: ولو بسط الله الرزق لعباده لبغوا في الأرض ولكن ينزل بقدر ما يشاء إنه بعباده خبير بصير
en: If Allah were to enlarge the provision for His Servants, they would indeed transgress beyond all bounds through the earth; but he sends (it) down in due measure as He pleases. For He is with His Servants Well-acquainted, Watchful.

source: وهو الذي ينزل الغيث من بعد ما قنطوا وينشر رحمته وهو الولي الحميد
en: He is the One that sends down rain (even) after (men) have given up all hope, and scatters His Mercy (far and wide). And He is the Protector, Worthy of all Praise.

source: ومن آياته خلق السماوات والأرض وما بث فيهما من دابة وهو على جمعهم إذا يشاء قدير
en: And among His Signs is the creation of the heavens and the earth, and the living creatures that He has scattered through them: and He has power to gather them together when He wills.

source: وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير
en: Whatever misfortune happens to you, is because on the things your hands have wrought, and for many (of them) He grants forgiveness.

source: وما أنتم بمعجزين في الأرض وما لكم من دون الله من ولي ولا نصير
en: Nor can ye frustrate (aught), (fleeing) through the earth; nor have ye, besides Allah, any one to protect or to help.

source: ومن آياته الجوار في البحر كالأعلام
en: And among His Signs are the ships, smooth-running through the ocean, (tall) as mountains.

source: إن يشأ يسكن الريح فيظللن رواكد على ظهره إن في ذلك لآيات لكل صبار شكور
en: If it be His Will He can still the Wind: then would they become motionless on the back of the (ocean). Verily in this are Signs for everyone who patiently perseveres and is grateful.

source: أو يوبقهن بما كسبوا ويعف عن كثير
en: Or He can cause them to perish because of the (evil) which (the men) have earned; but much doth He forgive.

source: ويعلم الذين يجادلون في آياتنا ما لهم من محيص
en: But let those know, who dispute about Our Signs, that there is for them no way of escape.

source: فما أوتيتم من شيء فمتاع الحياة الدنيا وما عند الله خير وأبقى للذين آمنوا وعلى ربهم يتوكلون
en: Whatever ye are given (here) is (but) a convenience of this life: but that which is with Allah is better and more lasting: (it is) for those who believe and put their trust in their Lord:

source: والذين يجتنبون كبائر الإثم والفواحش وإذا ما غضبوا هم يغفرون
en: Those who avoid the greater crimes and shameful deeds, and, when they are angry even then forgive;

source: والذين استجابوا لربهم وأقاموا الصلاة وأمرهم شورى بينهم ومما رزقناهم ينفقون
en: Those who hearken to their Lord, and establish regular Prayer; who (conduct) their affairs by mutual Consultation; who spend out of what We bestow on them for Sustenance;

source: والذين إذا أصابهم البغي هم ينتصرون
en: And those who, when an oppressive wrong is inflicted on them, (are not cowed but) help and defend themselves.

source: وجزاء سيئة سيئة مثلها فمن عفا وأصلح فأجره على الله إنه لا يحب الظالمين
en: The recompense for an injury is an injury equal thereto (in degree): but if a person forgives and makes reconciliation, his reward is due from Allah: for (Allah) loveth not those who do wrong.

source: ولمن انتصر بعد ظلمه فأولئك ما عليهم من سبيل
en: But indeed if any do help and defend themselves after a wrong (done) to them, against such there is no cause of blame.

source: إنما السبيل على الذين يظلمون الناس ويبغون في الأرض بغير الحق أولئك لهم عذاب أليم
en: The blame is only against those who oppress men and wrong-doing and insolently transgress beyond bounds through the land, defying right and justice: for such there will be a penalty grievous.

source: ولمن صبر وغفر إن ذلك لمن عزم الأمور
en: But indeed if any show patience and forgive, that would truly be an exercise of courageous will and resolution in the conduct of affairs.

source: ومن يضلل الله فما له من ولي من بعده وترى الظالمين لما رأوا العذاب يقولون هل إلى مرد من سبيل
en: For any whom Allah leaves astray, there is no protector thereafter. And thou wilt see the Wrong-doers, when in sight of the Penalty, Say: "Is there any way (to effect) a return?"

source: وتراهم يعرضون عليها خاشعين من الذل ينظرون من طرف خفي وقال الذين آمنوا إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة ألا إن الظالمين في عذاب مقيم
en: And thou wilt see them brought forward to the (Penalty), in a humble frame of mind because of (their) disgrace, (and) looking with a stealthy glance. And the Believers will say: "Those are indeed in loss, who have given to perdition their own selves and those belonging to them on the Day of Judgment. Behold! Truly the Wrong-doers are in a lasting Penalty!"

source: وما كان لهم من أولياء ينصرونهم من دون الله ومن يضلل الله فما له من سبيل
en: And no protectors have they to help them, other than Allah. And for any whom Allah leaves to stray, there is no way (to the Goal).

source: استجيبوا لربكم من قبل أن يأتي يوم لا مرد له من الله ما لكم من ملجإ يومئذ وما لكم من نكير
en: Hearken ye to your Lord, before there come a Day which there will be no putting back, because of (the Ordainment of) Allah! that Day there will be for you no place of refuge nor will there be for you any room for denial (of your sins)!

source: فإن أعرضوا فما أرسلناك عليهم حفيظا إن عليك إلا البلاغ وإنا إذا أذقنا الإنسان منا رحمة فرح بها وإن تصبهم سيئة بما قدمت أيديهم فإن الإنسان كفور
en: If then they run away, We have not sent thee as a guard over them. Thy duty is but to convey (the Message). And truly, when We give man a taste of a Mercy from Ourselves, he doth exult thereat, but when some ill happens to him, on account of the deeds which his hands have sent forth, truly then is man ungrateful!

source: لله ملك السماوات والأرض يخلق ما يشاء يهب لمن يشاء إناثا ويهب لمن يشاء الذكور
en: To Allah belongs the dominion of the heavens and the earth. He creates what He wills (and plans). He bestows (children) male or female according to His Will (and Plan),

source: أو يزوجهم ذكرانا وإناثا ويجعل من يشاء عقيما إنه عليم قدير
en: Or He bestows both males and females, and He leaves barren whom He will: for He is full of Knowledge and Power.

source: وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب أو يرسل رسولا فيوحي بإذنه ما يشاء إنه علي حكيم
en: It is not fitting for a man that Allah should speak to him except by inspiration, or from behind a veil, or by the sending of a messenger to reveal, with Allah's permission, what Allah wills: for He is Most High, Most Wise.

source: وكذلك أوحينا إليك روحا من أمرنا ما كنت تدري ما الكتاب ولا الإيمان ولكن جعلناه نورا نهدي به من نشاء من عبادنا وإنك لتهدي إلى صراط مستقيم
en: And thus have We, by Our Command, sent inspiration to thee: thou knewest not (before) what was Revelation, and what was Faith; but We have made the (Qur'an) a Light, wherewith We guide such of Our servants as We will; and verily thou dost guide (men) to the Straight Way,-

source: صراط الله الذي له ما في السماوات وما في الأرض ألا إلى الله تصير الأمور
en: The Way of Allah, to Whom belongs whatever is in the heavens and whatever is on earth. Behold (how) all affairs tend towards Allah!

source: والكتاب المبين
en: By the Book that makes things clear,-

source: إنا جعلناه قرآنا عربيا لعلكم تعقلون
en: We have made it a Qur'an in Arabic, that ye may be able to understand (and learn wisdom).

source: وإنه في أم الكتاب لدينا لعلي حكيم
en: And verily, it is in the Mother of the Book, in Our Presence, high (in dignity), full of wisdom.

source: أفنضرب عنكم الذكر صفحا أن كنتم قوما مسرفين
en: Shall We then take away the Message from you and repel (you), for that ye are a people transgressing beyond bounds?

source: وكم أرسلنا من نبي في الأولين
en: But how many were the prophets We sent amongst the peoples of old?

source: وما يأتيهم من نبي إلا كانوا به يستهزئون
en: And never came there a prophet to them but they mocked him.

source: فأهلكنا أشد منهم بطشا ومضى مثل الأولين
en: So We destroyed (them)- stronger in power than these;- and (thus) has passed on the Parable of the peoples of old.

source: ولئن سألتهم من خلق السماوات والأرض ليقولن خلقهن العزيز العليم
en: If thou wert to question them, 'Who created the heavens and the earth?' They would be sure to reply, 'they were created by (Him), the Exalted in Power, Full of Knowledge';-

source: الذي جعل لكم الأرض مهدا وجعل لكم فيها سبلا لعلكم تهتدون
en: (Yea, the same that) has made for you the earth (like a carpet) spread out, and has made for you roads (and channels) therein, in order that ye may find guidance (on the way);

source: والذي نزل من السماء ماء بقدر فأنشرنا به بلدة ميتا كذلك تخرجون
en: That sends down (from time to time) rain from the sky in due measure;- and We raise to life therewith a land that is dead; even so will ye be raised (from the dead);-

source: والذي خلق الأزواج كلها وجعل لكم من الفلك والأنعام ما تركبون
en: That has created pairs in all things, and has made for you ships and cattle on which ye ride,

source: لتستووا على ظهوره ثم تذكروا نعمة ربكم إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين
en: In order that ye may sit firm and square on their backs, and when so seated, ye may celebrate the (kind) favour of your Lord, and say, "Glory to Him Who has subjected these to our (use), for we could never have accomplished this (by ourselves),

source: وإنا إلى ربنا لمنقلبون
en: "And to our Lord, surely, must we turn back!"

source: وجعلوا له من عباده جزءا إن الإنسان لكفور مبين
en: Yet they attribute to some of His servants a share with Him (in his godhead)! truly is man a blasphemous ingrate avowed!

source: أم اتخذ مما يخلق بنات وأصفاكم بالبنين
en: What! has He taken daughters out of what He himself creates, and granted to you sons for choice?

source: وإذا بشر أحدهم بما ضرب للرحمن مثلا ظل وجهه مسودا وهو كظيم
en: When news is brought to one of them of (the birth of) what he sets up as a likeness to (Allah) Most Gracious, his face darkens, and he is filled with inward grief!

source: أومن ينشأ في الحلية وهو في الخصام غير مبين
en: Is then one brought up among trinkets, and unable to give a clear account in a dispute (to be associated with Allah)?

source: وجعلوا الملائكة الذين هم عباد الرحمن إناثا أشهدوا خلقهم ستكتب شهادتهم ويسألون
en: And they make into females angels who themselves serve Allah. Did they witness their creation? Their evidence will be recorded, and they will be called to account!

source: وقالوا لو شاء الرحمن ما عبدناهم ما لهم بذلك من علم إن هم إلا يخرصون
en: ("Ah!") they say, "If it had been the will of (Allah) Most Gracious, we should not have worshipped such (deities)!" Of that they have no knowledge! they do nothing but lie!

source: أم آتيناهم كتابا من قبله فهم به مستمسكون
en: What! have We given them a Book before this, to which they are holding fast?

source: بل قالوا إنا وجدنا آباءنا على أمة وإنا على آثارهم مهتدون
en: Nay! they say: "We found our fathers following a certain religion, and we do guide ourselves by their footsteps."

source: وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون
en: Just in the same way, whenever We sent a Warner before thee to any people, the wealthy ones among them said: "We found our fathers following a certain religion, and we will certainly follow in their footsteps."

source: قال أولو جئتكم بأهدى مما وجدتم عليه آباءكم قالوا إنا بما أرسلتم به كافرون
en: He said: "What! Even if I brought you better guidance than that which ye found your fathers following?" They said: "For us, we deny that ye (prophets) are sent (on a mission at all)."

source: فانتقمنا منهم فانظر كيف كان عاقبة المكذبين
en: So We exacted retribution from them: now see what was the end of those who rejected (Truth)!

source: وإذ قال إبراهيم لأبيه وقومه إنني براء مما تعبدون
en: Behold! Abraham said to his father and his people: "I do indeed clear myself of what ye worship:

source: إلا الذي فطرني فإنه سيهدين
en: "(I worship) only Him Who made me, and He will certainly guide me."

source: وجعلها كلمة باقية في عقبه لعلهم يرجعون
en: And he left it as a Word to endure among those who came after him, that they may turn back (to Allah).

source: بل متعت هؤلاء وآباءهم حتى جاءهم الحق ورسول مبين
en: Yea, I have given the good things of this life to these (men) and their fathers, until the Truth has come to them, and a messenger making things clear.

source: ولما جاءهم الحق قالوا هذا سحر وإنا به كافرون
en: But when the Truth came to them, they said: "This is sorcery, and we do reject it."

source: وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم
en: Also, they say: "Why is not this Qur'an sent down to some leading man in either of the two (chief) cities?"

source: أهم يقسمون رحمت ربك نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ليتخذ بعضهم بعضا سخريا ورحمت ربك خير مما يجمعون
en: Is it they who would portion out the Mercy of thy Lord? It is We Who portion out between them their livelihood in the life of this world: and We raise some of them above others in ranks, so that some may command work from others. But the Mercy of thy Lord is better than the (wealth) which they amass.

source: ولولا أن يكون الناس أمة واحدة لجعلنا لمن يكفر بالرحمن لبيوتهم سقفا من فضة ومعارج عليها يظهرون
en: And were it not that (all) men might become of one (evil) way of life, We would provide, for everyone that blasphemes against (Allah) Most Gracious, silver roofs for their houses and (silver) stair-ways on which to go up,

source: ولبيوتهم أبوابا وسررا عليها يتكئون
en: And (silver) doors to their houses, and thrones (of silver) on which they could recline,

source: وزخرفا وإن كل ذلك لما متاع الحياة الدنيا والآخرة عند ربك للمتقين
en: And also adornments of gold. But all this were nothing but conveniences of the present life: The Hereafter, in the sight of thy Lord is for the Righteous.

source: ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين
en: If anyone withdraws himself from remembrance of (Allah) Most Gracious, We appoint for him an evil one, to be an intimate companion to him.

source: وإنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون
en: Such (evil ones) really hinder them from the Path, but they think that they are being guided aright!

source: حتى إذا جاءنا قال يا ليت بيني وبينك بعد المشرقين فبئس القرين
en: At length, when (such a one) comes to Us, he says (to his evil companion): "Would that between me and thee were the distance of East and West!" Ah! evil is the companion (indeed)!

source: ولن ينفعكم اليوم إذ ظلمتم أنكم في العذاب مشتركون
en: When ye have done wrong, it will avail you nothing, that Day, that ye shall be partners in Punishment!

source: أفأنت تسمع الصم أو تهدي العمي ومن كان في ضلال مبين
en: Canst thou then make the deaf to hear, or give direction to the blind or to such as (wander) in manifest error?

source: فإما نذهبن بك فإنا منهم منتقمون
en: Even if We take thee away, We shall be sure to exact retribution from them,

source: أو نرينك الذي وعدناهم فإنا عليهم مقتدرون
en: Or We shall show thee that (accomplished) which We have promised them: for verily We shall prevail over them.

source: فاستمسك بالذي أوحي إليك إنك على صراط مستقيم
en: So hold thou fast to the Revelation sent down to thee; verily thou art on a Straight Way.

source: وإنه لذكر لك ولقومك وسوف تسألون
en: The (Qur'an) is indeed the message, for thee and for thy people; and soon shall ye (all) be brought to account.

source: واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون
en: And question thou our messengers whom We sent before thee; did We appoint any deities other than (Allah) Most Gracious, to be worshipped?

source: ولقد أرسلنا موسى بآياتنا إلى فرعون وملئه فقال إني رسول رب العالمين
en: We did send Moses aforetime, with Our Signs, to Pharaoh and his Chiefs: He said, "I am a messenger of the Lord of the Worlds."

source: فلما جاءهم بآياتنا إذا هم منها يضحكون
en: But when he came to them with Our Signs, behold they ridiculed them.

source: وما نريهم من آية إلا هي أكبر من أختها وأخذناهم بالعذاب لعلهم يرجعون
en: We showed them Sign after Sign, each greater than its fellow, and We seized them with Punishment, in order that they might turn (to Us).

source: وقالوا يا أيه الساحر ادع لنا ربك بما عهد عندك إننا لمهتدون
en: And they said, "O thou sorcerer! Invoke thy Lord for us according to His covenant with thee; for we shall truly accept guidance."

source: فلما كشفنا عنهم العذاب إذا هم ينكثون
en: But when We removed the Penalty from them, behold, they broke their word.

source: ونادى فرعون في قومه قال يا قوم أليس لي ملك مصر وهذه الأنهار تجري من تحتي أفلا تبصرون
en: And Pharaoh proclaimed among his people, saying: "O my people! Does not the dominion of Egypt belong to me, (witness) these streams flowing underneath my (palace)? What! see ye not then?

source: أم أنا خير من هذا الذي هو مهين ولا يكاد يبين
en: "Am I not better than this (Moses), who is a contemptible wretch and can scarcely express himself clearly?

source: فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين
en: "Then why are not gold bracelets bestowed on him, or (why) come (not) with him angels accompanying him in procession?"

source: فاستخف قومه فأطاعوه إنهم كانوا قوما فاسقين
en: Thus did he make fools of his people, and they obeyed him: truly were they a people rebellious (against Allah).

source: فلما آسفونا انتقمنا منهم فأغرقناهم أجمعين
en: When at length they provoked Us, We exacted retribution from them, and We drowned them all.

source: فجعلناهم سلفا ومثلا للآخرين
en: And We made them (a people) of the Past and an Example to later ages.

source: ولما ضرب ابن مريم مثلا إذا قومك منه يصدون
en: When (Jesus) the son of Mary is held up as an example, behold, thy people raise a clamour thereat (in ridicule)!

source: وقالوا أآلهتنا خير أم هو ما ضربوه لك إلا جدلا بل هم قوم خصمون
en: And they say, "Are our gods best, or he?" This they set forth to thee, only by way of disputation: yea, they are a contentious people.

source: إن هو إلا عبد أنعمنا عليه وجعلناه مثلا لبني إسرائيل
en: He was no more than a servant: We granted Our favour to him, and We made him an example to the Children of Israel.

source: ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون
en: And if it were Our Will, We could make angels from amongst you, succeeding each other on the earth.

source: وإنه لعلم للساعة فلا تمترن بها واتبعون هذا صراط مستقيم
en: And (Jesus) shall be a Sign (for the coming of) the Hour (of Judgment): therefore have no doubt about the (Hour), but follow ye Me: this is a Straight Way.

source: ولا يصدنكم الشيطان إنه لكم عدو مبين
en: Let not the Evil One hinder you: for he is to you an enemy avowed.

source: ولما جاء عيسى بالبينات قال قد جئتكم بالحكمة ولأبين لكم بعض الذي تختلفون فيه فاتقوا الله وأطيعون
en: When Jesus came with Clear Signs, he said: "Now have I come to you with Wisdom, and in order to make clear to you some of the (points) on which ye dispute: therefore fear Allah and obey me.

source: إن الله هو ربي وربكم فاعبدوه هذا صراط مستقيم
en: "For Allah, He is my Lord and your Lord: so worship ye Him: this is a Straight Way."

source: فاختلف الأحزاب من بينهم فويل للذين ظلموا من عذاب يوم أليم
en: But sects from among themselves fell into disagreement: then woe to the wrong-doers, from the Penalty of a Grievous Day!

source: هل ينظرون إلا الساعة أن تأتيهم بغتة وهم لا يشعرون
en: Do they only wait for the Hour - that it should come on them all of a sudden, while they perceive not?

source: الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين
en: Friends on that day will be foes, one to another,- except the Righteous.

source: يا عباد لا خوف عليكم اليوم ولا أنتم تحزنون
en: My devotees! no fear shall be on you that Day, nor shall ye grieve,-

source: الذين آمنوا بآياتنا وكانوا مسلمين
en: (Being) those who have believed in Our Signs and bowed (their wills to Ours) in Islam.

source: ادخلوا الجنة أنتم وأزواجكم تحبرون
en: Enter ye the Garden, ye and your wives, in (beauty and) rejoicing.
